Repository: AkremBelkahla/simple-ai-page-generator
Catalog: languages/ai-content-gen-*.po
Languages: fr_fr

source: Simple AI Page Generator requires PHP %s or higher. You are running PHP %s.
fr_fr: Simple AI Page Generator nécessite PHP %s ou supérieur. Vous utilisez PHP %s.

source: Simple AI Page Generator requires WordPress %s or higher.
fr_fr: Simple AI Page Generator nécessite WordPress %s ou supérieur.

source: Settings
fr_fr: Paramètres

source: Security check failed
fr_fr: Vérification de sécurité échouée

source: Insufficient permissions
fr_fr: Permissions insuffisantes

source: Invalid parameters
fr_fr: Paramètres invalides

source: API connection successful
fr_fr: Connexion API réussie

source: AI Content Generator
fr_fr: Générateur de Contenu IA

source: AI Generator
fr_fr: Générateur IA

source: Statistics
fr_fr: Statistiques

source: You do not have sufficient permissions to access this page.
fr_fr: Vous n'avez pas les permissions nécessaires pour accéder à cette page.

source: API Configuration
fr_fr: Configuration API

source: Configure your API keys for different AI services. At least one API key is required.
fr_fr: Configurez vos clés API pour les différents services IA. Au moins une clé API est requise.

source: General Settings
fr_fr: Paramètres Généraux

source: Configure default settings for content generation.
fr_fr: Configurez les paramètres par défaut pour la génération de contenu.

source: API Key
fr_fr: Clé API

source: Show/Hide
fr_fr: Afficher/Masquer

source: Test Connection
fr_fr: Tester la Connexion

source: Get your %s API key
fr_fr: Obtenir votre clé API %s

source: Default AI Model
fr_fr: Modèle IA par Défaut

source: Select the default AI model for content generation.
fr_fr: Sélectionnez le modèle IA par défaut pour la génération de contenu.

source: Not configured
fr_fr: Non configuré

source: Default Word Count
fr_fr: Nombre de Mots par Défaut

source: Default word count for generated content.
fr_fr: Nombre de mots par défaut pour le contenu généré.

source: words
fr_fr: mots

source: Enable Caching
fr_fr: Activer le Cache

source: Cache API responses to improve performance and reduce costs
fr_fr: Mettre en cache les réponses API pour améliorer les performances et réduire les coûts

source: Enable Logging
fr_fr: Activer les Logs

source: Enable detailed logging for debugging
fr_fr: Activer les logs détaillés pour le débogage

source: Generate New Content
fr_fr: Générer un Nouveau Contenu

source: No API keys configured. Please configure at least one API key in the settings.
fr_fr: Aucune clé API configurée. Veuillez configurer au moins une clé API dans les paramètres.

source: Configure APIs
fr_fr: Configurer les APIs

source: Content Title
fr_fr: Titre du Contenu

source: Enter a topic or leave empty for random content
fr_fr: Entrez un sujet ou laissez vide pour un contenu aléatoire

source: The main topic or title for your content.
fr_fr: Le sujet principal ou titre de votre contenu.

source: AI Model
fr_fr: Modèle IA

source: Select the AI model to use for generation.
fr_fr: Sélectionnez le modèle IA à utiliser pour la génération.

source: Word Count
fr_fr: Nombre de Mots

source: Approximate number of words to generate.
fr_fr: Nombre approximatif de mots à générer.

source: Content Type
fr_fr: Type de Contenu

source: Post
fr_fr: Article

source: Type of content to create.
fr_fr: Type de contenu à créer.

source: Post Status
fr_fr: Statut de Publication

source: Draft
fr_fr: Brouillon

source: Published
fr_fr: Publié

source: Pending Review
fr_fr: En Attente de Révision

source: Status for the generated content.
fr_fr: Statut pour le contenu généré.

source: Generate Content
fr_fr: Générer le Contenu

source: Quick Tips
fr_fr: Conseils Rapides

source: Be specific with your title for better results
fr_fr: Soyez précis avec votre titre pour de meilleurs résultats

source: Review and edit generated content before publishing
fr_fr: Révisez et éditez le contenu généré avant de publier

source: Different AI models may produce different styles
fr_fr: Différents modèles IA peuvent produire différents styles

source: Longer content takes more time to generate
fr_fr: Un contenu plus long prend plus de temps à générer

source: Recent Generations
fr_fr: Générations Récentes

source: ago
fr_fr: il y a

source: No content generated yet.
fr_fr: Aucun contenu généré pour le moment.

source: AI Content Generator - Statistics
fr_fr: Générateur de Contenu IA - Statistiques

source: Total Generated
fr_fr: Total Généré

source: Posts
fr_fr: Articles

source: Usage by AI Model
fr_fr: Utilisation par Modèle IA

source: Content Generated
fr_fr: Contenu Généré

source: Percentage
fr_fr: Pourcentage

source: No statistics available yet. Start generating content!
fr_fr: Aucune statistique disponible pour le moment. Commencez à générer du contenu !

source: API key for %s is not configured
fr_fr: La clé API pour %s n'est pas configurée

source: Model %s is not supported
fr_fr: Le modèle %s n'est pas supporté

source: blog post
fr_fr: article de blog

source: Write a comprehensive %s of approximately %d words
fr_fr: Rédigez un(e) %s complet(e) d'environ %d mots

source: about: %s
fr_fr: sur : %s

source: Structure the content with proper HTML formatting including headings (h2, h3), paragraphs, lists, and emphasis where appropriate. Make it engaging, informative, and SEO-friendly.
fr_fr: Structurez le contenu avec un formatage HTML approprié incluant des titres (h2, h3), des paragraphes, des listes et des emphases si nécessaire. Rendez-le engageant, informatif et optimisé pour le SEO.

source: Generated Content - %s
fr_fr: Contenu Généré - %s

source: Invalid OpenAI API key
fr_fr: Clé API OpenAI invalide

source: Invalid response from OpenAI API
fr_fr: Réponse invalide de l'API OpenAI

source: OpenAI API test failed
fr_fr: Test de l'API OpenAI échoué

source: You do not have the necessary permissions to access this page.
fr_fr: Vous n'avez pas les permissions nécessaires pour accéder à cette page.

source: Generating content...
fr_fr: Génération du contenu...

source: Content generated successfully!
fr_fr: Contenu généré avec succès !

source: An error occurred. Please try again.
fr_fr: Une erreur s'est produite. Veuillez réessayer.
